# install with `brew bundle install`
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "pkgxdev/made"
tap "ngrok/ngrok"
tap "warrensbox/tap"
tap "wtfutil/wtfutil"
brew "act"
brew "age"
brew "atuin"
brew "autojump"
brew "coder"
brew "dialog"
brew "openssl@3"
brew "gawk"
brew "grep"
brew "kompose"
brew "xz"
brew "readline"
brew "sqlite"
brew "lnav"
brew "magic-wormhole"
brew "nano"
brew "oci-cli"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "sops"
brew "tcl-tk"
brew "tfenv"
brew "trippy"
brew "wtfutil"
brew "zlib"
brew "pkgxdev/made/pkgx"
brew "cloudflare/cloudflare/cloudflared"
cask "1password-cli"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "podman-desktop"
cask "warp"
vscode "100lvlmaster.one-for-all"
vscode "aaron-bond.better-comments"
vscode "albert.TabOut"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "AntonReshetov.masscode-assistant"
vscode "batisteo.vscode-django"
vscode "bbenoist.shell"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "Continue.continue"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "denoland.vscode-deno"
vscode "docsmsft.docs-yaml"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotenv.dotenv-vscode"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "Hamza-Aziane.obsidian-dark"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "jevakallio.vscode-live-frame"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "KevinRose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.MagicPython"
vscode "marcostazi.VS-code-vagrantfile"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mrded.railscasts"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "ParallelsDesktop.parallels-desktop"
vscode "patbenatar.advanced-new-file"
vscode "Perkovec.emoji"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "Rubymaniac.vscode-direnv"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "signageos.signageos-vscode-sops"
vscode "signageos.signageos-vscode-sops-beta"
vscode "sleistner.vscode-fileutils"
vscode "softwaredotcom.swdc-vscode"
vscode "sourcery.sourcery"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "TeamHub.teamhub"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wesbos.theme-cobalt2"
vscode "wholroyd.jinja"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "Youssef.viow"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
