aaron-bond.better-comments
albert.tabout
bungcip.better-toml
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
codeium.windsurfpyright
davidanson.vscode-markdownlint
donjayamanne.githistory
dotjoshjohnson.xml
dracula-theme.theme-dracula
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
evan-buss.font-switcher
formulahendry.auto-close-tag
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
gruntfuggly.todo-tree
hashicorp.hcl
hashicorp.terraform
kevinrose.vsc-python-indent
magicstack.magicpython
mechatroner.rainbow-csv
mikestead.dotenv
mkhl.shfmt
ms-azuretools.vscode-docker
ms-pyright.pyright
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-vscode.live-server
oderwat.indent-rainbow
orta.vscode-jest
pkief.material-icon-theme
redhat.vscode-yaml
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
sourcery.sourcery
streetsidesoftware.code-spell-checker
sumneko.lua
tamasfe.even-better-toml
timonwong.shellcheck
wholroyd.jinja
zhuangtongfa.material-theme
